src/testdatagenerator/trunk/java/de/decidr/test/database/resources/files/soaptemplate.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header bodyElementName="startProcess" targetNamespace="http://decidr.de/DefaultTenant/processes/302"/>
  <SOAP-ENV:Body>
    <decidr:startProcess xmlns:decidr="http://decidr.de/DefaultTenant/processes/302"/>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
